31803smith/openharness/device/esp32-circle/sdkconfig.defaults
# Default sdkconfig for the Interns commander device.
# These are applied on first `idf.py build`; tweak via `idf.py menuconfig`.

# --- Target / flash ---
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- OTA (over-the-air firmware update) ---
# Dual-OTA partitions (see partitions.csv) + rollback: a freshly-flashed OTA image boots in
# PENDING_VERIFY and must call esp_ota_mark_app_valid_cancel_rollback() once healthy, else the
# bootloader reverts to the previous slot on the next reboot (a bad update can't brick the device).
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
# Allow OTA over plain HTTP (no TLS). Security here is version-gate + SHA-256 integrity check
# (see main/ota.c); image signing / HTTPS is a deferred follow-up. Without this, esp_https_ota_begin
# refuses a non-verified server ("No option for server verification is enabled").
CONFIG_ESP_HTTPS_OTA_ALLOW_HTTP=y

# --- PSRAM (ESP32-S3R8 = 8MB octal PSRAM; LVGL object pool lives here) ---
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y

# --- CPU ---
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# --- FreeRTOS ---
CONFIG_FREERTOS_HZ=1000

# --- WiFi (STA for commander, AP for provisioning portal) ---
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y

# --- HTTP server (captive portal) ---
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024

# --- WebSocket client ---
CONFIG_WS_TRANSPORT=y

# --- TLS (wss:// + https:// to the prod backend) ---
# Verify the prod cert chain against Mozilla's CA roots via esp_crt_bundle_attach.
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
# Leave CONFIG_MBEDTLS_HAVE_TIME_DATE OFF (default) so the TLS handshake does NOT depend on a synced
# clock — REST pairing runs before SNTP, and cert validity dates are not enforced.
# Allocate mbedTLS buffers (~32KB per TLS conn: two 16KB record buffers) from the 8MB PSRAM instead
# of the ~150KB internal heap. Internal heap fragments after the first few TLS connections, so the
# persistent commander WSS + periodic REST fail ssl_setup with -0x7F00 (ALLOC_FAILED) / sock<0.
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y

# --- Main task stack (UI + init) ---
# OTA boot mode performs HTTP download and SHA verification on app_main. The
# measured 8KiB stack left only 1,444B (17.6%); 10KiB restores the 25% margin.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=10240

# --- Log level ---
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# --- LVGL v9 (configured via the lvgl/lvgl component's Kconfig) ---
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_USE_PERF_MONITOR=n
# Fonts used by ui_screens.c (montserrat_14 default; _22 headers; _30 OTA title; _40 big pairing code).
# 18 is the Model/Effort pills; 22 was 20% too big on the panel. 24 is the swarm pill that replaced
# them — one pill on the band where two sat, so it has the room the pair did not.
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_22=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_30=y
CONFIG_LV_FONT_MONTSERRAT_40=y
# Keep a small built-in internal LVGL pool and add a 64KiB PSRAM pool at
# runtime. EXPAND_SIZE sets the TLSF size classes needed for that added pool.
CONFIG_LV_USE_LOG=y
CONFIG_LV_LOG_LEVEL_WARN=y
CONFIG_LV_LOG_PRINTF=y
CONFIG_LV_ASSERT_HANDLER_INCLUDE="stdlib.h"
CONFIG_LV_MEM_SIZE_KILOBYTES=8
CONFIG_LV_MEM_POOL_EXPAND_SIZE_KILOBYTES=512

# --- LWIP: room for commander WS + HTTP client + DNS concurrently ---
CONFIG_LWIP_MAX_SOCKETS=16
# Larger TCP send/recv buffers so continuous voice PCM streaming tolerates WiFi jitter
# (default ~5.7KB fills in ~180ms at 32KB/s → esp_websocket_client tears down on write-0).
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=65534
CONFIG_LWIP_TCP_WND_DEFAULT=65534
CONFIG_LWIP_TCP_RECVMBOX_SIZE=16
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# Panic output must reach the wire. The PRIMARY console is where the panic handler, the stack-overflow
# canary and the task watchdog print — and it used to be UART0, whose pins this round board does not bring
# out anywhere. So a crash was completely invisible: the device rebooted, the USB port re-enumerated under
# a new name, and the only symptom was a byte counter that stopped moving. Debugging that is guesswork.
#
# With USB-Serial-JTAG as the PRIMARY console, a panic goes out the same wire the protocol uses, arrives as
# a non-JSON line, and CableLink.onRawLine already records those to cable.log. Secondary is NONE because a
# console cannot be its own mirror.
CONFIG_ESP_CONSOLE_UART_DEFAULT=n
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
